SeanSouth/O1_demo/doc/DA14680AC.xml
	<description>This (read-only) register determines the data items currently fetched by the DMA channel, during an on-going transfer. When the transfer is completed, the register is automatically reset to 0.
The DMA channel uses this register to form the source/destination address of the next DMA cycle, considering also AINC/BINC and BW.</description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>DMA7_INT_REG</name>
	<description>DMA receive interrupt register channel 7</description>
	<addressOffset>0x00000078</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>DMA7_INT</name>
	<description>Number of transfers until an interrupt is generated. The interrupt is generated after a transfer, if DMAx_INT_REG is equal to DMAx_IDX_REG and before DMAx_IDX_REG is incremented. The bit-field IRQ_ENABLE of DMAx_CTRL_REG must be set to '1' to let the controller generate the interrupt.</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>DMA7_LEN_REG</name>
	<description>DMA receive length register channel 7</description>
	<addressOffset>0x0000007a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>DMA7_LEN</name>
	<description>DMA channel's transfer length. DMAx_LEN of value 0, 1, 2, ... results into an actual transfer length of 1, 2, 3, ...</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>DMA_CLEAR_INT_REG</name>
	<description>DMA clear interrupt register</description>
	<addressOffset>0x00000084</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>DMA_RST_IRQ_CH7</name>
	<description>Writing a 1 will reset the IRQ of channel 7 ; writing a 0 will have no effect.</description>
	<access>write-only</access>
	<bitRange>[7:7]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DMA_RST_IRQ_CH6</name>
	<description>Writing a 1 will reset the IRQ of channel 6 ; writing a 0 will have no effect.</description>
	<access>write-only</access>
	<bitRange>[6:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DMA_RST_IRQ_CH5</name>
	<description>Writing a 1 will reset the IRQ of channel 5 ; writing a 0 will have no effect.</description>
	<access>write-only</access>
	<bitRange>[5:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DMA_RST_IRQ_CH4</name>
	<description>Writing a 1 will reset the IRQ of channel 4 ; writing a 0 will have no effect.</description>
	<access>write-only</access>
	<bitRange>[4:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DMA_RST_IRQ_CH3</name>
	<description>Writing a 1 will reset the IRQ of channel 3 ; writing a 0 will have no effect.</description>
	<access>write-only</access>
	<bitRange>[3:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DMA_RST_IRQ_CH2</name>
	<description>Writing a 1 will reset the IRQ of channel 2 ; writing a 0 will have no effect.</description>
	<access>write-only</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DMA_RST_IRQ_CH1</name>
	<description>Writing a 1 will reset the IRQ of channel 1 ; writing a 0 will have no effect.</description>
	<access>write-only</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DMA_RST_IRQ_CH0</name>
	<description>Writing a 1 will reset the IRQ of channel 0 ; writing a 0 will have no effect.</description>
	<access>write-only</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>DMA_INT_STATUS_REG</name>
	<description>DMA interrupt status register</description>
	<addressOffset>0x00000082</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>DMA_IRQ_CH7</name>
	<description>0 = IRQ on channel 7 is not set
1 = IRQ on channel 7 is set</description>
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DMA_IRQ_CH6</name>
	<description>0 = IRQ on channel 6 is not set
1 = IRQ on channel 6 is set</description>
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DMA_IRQ_CH5</name>
	<description>0 = IRQ on channel 5 is not set
1 = IRQ on channel 5 is set</description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DMA_IRQ_CH4</name>
	<description>0 = IRQ on channel 4 is not set
1 = IRQ on channel 4 is set</description>
	<access>read-only</access>
	<bitRange>[4:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DMA_IRQ_CH3</name>
	<description>0 = IRQ on channel 3 is not set
1 = IRQ on channel 3 is set</description>
	<access>read-only</access>
	<bitRange>[3:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DMA_IRQ_CH2</name>
	<description>0 = IRQ on channel 2 is not set
1 = IRQ on channel 2 is set</description>
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DMA_IRQ_CH1</name>
	<description>0 = IRQ on channel 1 is not set
1 = IRQ on channel 1 is set</description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DMA_IRQ_CH0</name>
	<description>0 = IRQ on channel 0 is not set
1 = IRQ on channel 0 is set</description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>DMA_REQ_MUX_REG</name>
	<description>DMA channel assignments</description>
	<addressOffset>0x00000080</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>DMA67_SEL</name>
	<description>Select which combination of peripherals are mapped on the DMA channels. The peripherals are mapped as pairs on two channels.
Here, the first DMA request is mapped on channel 6 and the second on channel 7.
See DMA01_SEL for the peripherals' mapping.</description>
	<access>read-write</access>
	<bitRange>[15:12]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DMA45_SEL</name>
	<description>Select which combination of peripherals are mapped on the DMA channels. The peripherals are mapped as pairs on two channels.
Here, the first DMA request is mapped on channel 4 and the second on channel 5.
See DMA01_SEL for the peripherals' mapping.</description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DMA23_SEL</name>
	<description>Select which combination of peripherals are mapped on the DMA channels. The peripherals are mapped as pairs on two channels.
Here, the first DMA request is mapped on channel 2 and the second on channel 3.
See DMA01_SEL for the peripherals' mapping.</description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DMA01_SEL</name>
	<description>Select which combination of peripherals are mapped on the DMA channels. The peripherals are mapped as pairs on two channels.
Here, the first DMA request is mapped on channel 0 and the second on channel 1.
0x0: SPI_rx / SPI_tx
0x1: SPI2_rx / SPI2_tx
0x2: UART_rx / UART_tx
0x3: UART2_rx / UART2_tx
0x4: I2C_rx / I2C_tx
0x5: I2C2_rx / I2C2_tx
0x6: USB_rx / USB_tx
0x7: Reserved
0x8: PCM_rx / PCM_tx
0x9: SRC_rx / SRC_tx (for all the supported conversions)
0xA: FTDF_rx / FTDF_tx
0xB: Reserved
0xC: ADC / -
0xD: Reserved
0xE: Reserved
0xF: Reserved

Note: If any of the four available peripheral selector fields (DMA01_SEL, DMA23_SEL, DMA45_SEL, DMA67_SEL) have the same value, the lesser significant selector has higher priority and will control the dma acknowledge. Hence, if DMA01_SEL = DMA23_SEL, the channels 0 and 1 will generate the DMA acknowledge signals for the selected peripheral. Consequently, it is suggested to assign the intended peripheral value to a unique selector field.</description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>ECC</name>
	<version>1.0</version>
	<description>ECC registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50006000</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>24</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>ECC_COMMAND_REG</name>
	<description>Command register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>ECC_CalcR2</name>
	<description>This bit indicates if the IP has to calculate R mod N for the next operation. This bit must be set to 1 when a new prime number has been programmed. This bit is automatically cleared when R mod N has been calculated.
'0': no effect
'1': forces the IP to re-calculate R mod N</description>
	<access>read-write</access>
	<bitRange>[31:31]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ECC_SignB</name>
	<description>Sign of parameter B in equation y2=x3+Ax+B
'0': B is positive
'1': B is negative</description>
	<access>read-write</access>
	<bitRange>[30:30]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ECC_SignA</name>
	<description>Sign of parameter A in equation y2=x3+Ax+B
'0': A is positive
'1': A is negative</description>
	<access>read-write</access>
	<bitRange>[29:29]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ECC_SizeOfOperands</name>
	<description>This field defines the size (= number of 64-bit double words) of the operands for the current operation. Possible values are limited by the generic parameter g_Log2MaxDataSize that defines the max space allocated or reserved to each operand.
Arbitrary Data/Key size from 128 up to 4096 are supported:
0x02 (02d) -&gt; 128-bit Data/Key size

