SeanSouth/O1_demo/doc/DA14680AC.xml
0x40 (64d) -&gt; 4096-bit Data/Key size
Size Of Operands for RSA-DSA:
0x10 -&gt; 1024-bit RSA-DSA
0x20 -&gt; 2048-bit RSA-DSA
0x40 -&gt; 4096-bit RSA-DSA
ECC-ECDSA - Prime Field F(p)
0x03 -&gt; 192-bit (Curve P-192)
0x04 -&gt; 256-bit (Curves P-224 &amp; P-256)
0x06 -&gt; 384-bit (Curve P-384)
0x09 -&gt; 576-bit (Curve P-521)
ECC-ECDSA - Binary Field F(2m)
0x03 -&gt; 192-bit (Curve K-163)
0x04 -&gt; 256-bit (Curve K-233)
0x05 -&gt; 320-bit (Curve K-283)
0x07 -&gt; 448-bit (Curve K-409)
0x09 -&gt; 576-bit (Curve K-571)
- 4 Xers: 0x01, 0x02, 0x4, 0x6 -&gt; 64, 128 &amp; multiples of 128 bits
- 16 Xers: 0x01, 0x02, 0x4, 0x8 -&gt; 64, 128, 256 &amp; multiples of 256 bits
- 64 Xers: 0x02, 0x04, 0x8, 0x10 -&gt; 128, 256, 512 &amp; multiples of 512 bits
- 256 Xers: 0x04, 0x08, 0x10, 0x20 -&gt; 256, 512, 1024 &amp; multiples of 1024 bits</description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ECC_Field</name>
	<description>'0': Field is F(p)
'1': Field is F(2m)</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ECC_TypeOperation</name>
	<description>Primitive Arithmetic Operations F(p) &amp; F(2m)
[6:4] = 0x0
[3:0] =
0x0 -&gt; Reserved
0x1 -&gt; Modular Addition
0x2 -&gt; Modular Subtraction
0x3 -&gt; Modular Multiplication (Odd N)
0x4 -&gt; Modular Reduction (Odd N)
0x5 -&gt; Modular Division (Odd N)
0x6 -&gt; Modular Inversion (Odd N)
0x7 -&gt; Reserved
0x8 -&gt; Multiplication
0x9 -&gt; Modular Inversion (Even N)
0xA -&gt; Modular Reduction (Even N)
others -&gt; Reserved
C = A + B mod N
C = A - B mod N
C = A * B mod N
C = B mod N
C = A/B mod N
C = 1/B mod N
C = A * B
C = 1/B mod N
C = B mod N
High-level RSA, CRT &amp; DSA Operations - F(p) only
([7] forced to 0)
[6:4] = 0x1
[3:0] =
0x0 -&gt; Modular Exponentiation (C=A^B mod N)
0x1 -&gt; Private Key Generation
0x2 -&gt; CRT Key Parameter Generation
0x3 -&gt; CRT Decryption
0x4 -&gt; RSA Encryption
0x5 -&gt; RSA Decryption
0x6 -&gt; RSA Signature Generation
0x7 -&gt; RSA Signature Verification
0x8 -&gt; DSA Key Gen
0x9 -&gt; DSA Signature Generation
0xA -&gt; DSA Signature Verification
others -&gt; Reserved
Primitive ECC &amp; Check Point Operations F(p) &amp; F(2m)
[6:4] = 0x2
[3:0] =
0x0 -&gt; Point Doubling (Projective Coord.)
0x1 -&gt; Point Addition (Projective Coord.)
0x2 -&gt; Point Multiplication (Projective coordinates)
0x3 -&gt; Check_AB (ECDSA)
0x4 -&gt; Check_n (ECDSA)
0x5 -&gt; Check_Couple_Less_Prime (ECDSA)
0x6 -&gt; Check_Point_On_Curve
others -&gt; Reserved
High-level ECC ECDSA Operations F(p) &amp; F(2m)
[6:4] = 0x3
[3:0] =
0x0 -&gt; ECDSA Signature Generation
0x1 -&gt; ECDSA Signature Verification
0x2 -&gt; ECDSA Domain Parameters Validation
others -&gt; Reserved
Primality Test Rabin-Miller
[6:4] = 0x4
[3:0] =
0x0 -&gt; Round Miller-Rabin
0x1 -&gt; Init Miller-Rabin
others -&gt; Reserved
[6:4]=0x5, 0x6, 0x7 -&gt; Reserved</description>
	<access>read-write</access>
	<bitRange>[6:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>ECC_CONFIG_REG</name>
	<description>Configuration register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x001fffff</resetMask>
	<fields>
	<field>
	<name>ECC_OpPtrC</name>
	<description>When executing primitive arithmetic operations, this pointer defines the location where the result will be stored in Memory.</description>
	<access>read-write</access>
	<bitRange>[20:16]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ECC_OpPtrB</name>
	<description>When executing primitive arithmetic operations, this Pointer defines where operand B is located in memory.</description>
	<access>read-write</access>
	<bitRange>[12:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ECC_OpPtrA</name>
	<description>When executing primitive arithmetic operations, this Pointer defines where operand A is located in memory.</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>ECC_CONTROL_REG</name>
	<description>Control register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>ECC_Start</name>
	<description>The Start signal is activated when all data and key inputs have been loaded in the external crypto memory and are available for processing. This signal is active high and is sampled on the rising edge of Clk.
When this signal goes high, the PK Command present in the PK_CommandReg[] is initiated and executed. The PK_Start signal is ignored when the core is already processing data and is automatically cleared when the operation is finished</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>ECC_LOADMICROCODE_REG</name>
	<description>Used to upload Crypto Code from CPU into the uCode ram</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0007ffff</resetMask>
	<fields>
	<field>
	<name>ECC_FirstWord</name>
	<description>This bit must be set to 1 when writing the 1st 18-bit Code word into the core. The address pointer to the Code memory is cleared when this bit is active.
When this bit is set to 0, the address pointer is incremented at every write operation into this register</description>
	<access>read-write</access>
	<bitRange>[18:18]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ECC_uCode</name>
	<description>18-bit Code word</description>
	<access>read-write</access>
	<bitRange>[17:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>ECC_STATUS_REG</name>
	<description>Status register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0001ffff</resetMask>
	<fields>
	<field>
	<name>ECC_Busy</name>
	<description>This Status Signal indicates that the core is processing data. This signal is active high and goes low when the selected algorithm is finished.</description>
	<access>read-only</access>
	<bitRange>[16:16]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ECC_PrimalityTestResult</name>
	<description>After the Miller-Rabin Primality test, this flag is:
- set to 0 when the random number under test is probably prime
- cleared to 1 when the random number under test is composite</description>
	<access>read-only</access>
	<bitRange>[12:12]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ECC_NotInvertible</name>
	<description>This flag is set to 1 when executing a modular inversion (PK_CommandReg[3:0] = 0x6 or 0x9) if the operand is not invertible.</description>
	<access>read-only</access>
	<bitRange>[11:11]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ECC_Param_AB_NotValid</name>
	<description>Status signal set to 1 when parameters A and B are not valid, i.e 4A+ 27B = 0. This flag is updated after execution of the command Check_AB.</description>
	<access>read-only</access>
	<bitRange>[10:10]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ECC_Signature_NotValid</name>
	<description>This flag indicates if the signature can be accepted or must be rejected.
This flag is set to 1 when the signature is not valid and is updated after execution of the command ECDSA_Generation, ECDSA_Verification, DSA_Generation, DSA_Verification.</description>
	<access>read-only</access>
	<bitRange>[9:9]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ECC_Param_n_NotValid</name>
	<description>Status signal set to 1 when Parameter n is not valid.
This flag is updated after execution of the command Check_n.</description>
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ECC_Couple_NotValid</name>
	<description>Status signal set to 1 when couple x, y is not valid (i.e. not smaller than the prime).
This flag is updated after execution of the command Check_Couple_Less_Prime.</description>
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ECC_Point_Px_AtInfinity</name>
	<description>Status signal set to 1 when Point Px is at the infinity.
This flag is updated after execution of an ECC operation.</description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ECC_Point_Px_NotOnCurve</name>
	<description>Status signal set to 1 when Point Px is not on the defined EC. This flag is updated after execution of the command Check_Point_OnCurve.</description>
	<access>read-only</access>
	<bitRange>[4:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ECC_Fail_Address</name>
	<description>Address of the last Point detected as Not On Curve, Not Valid or at the infinity.</description>
	<access>read-only</access>
	<bitRange>[3:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>ECC_VERSION_REG</name>
	<description>Version register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000400</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>ECC_HVN</name>
	<description>Version of IP to be read via CPU interface.</description>
	<access>read-only</access>
	<bitRange>[15:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ECC_SVN</name>
	<description>Version of Crypto code to be read via CPU interface.</description>
	<access>read-only</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>FTDF</name>
	<version>1.0</version>
	<description>FTDF registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x40080000</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>69640</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>FTDF_BUILDTIME_0_REG</name>
	<description>Build time</description>
	<addressOffset>0x00010010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>BUILDTIME</name>
	<description>Build time of device </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_BUILDTIME_1_REG</name>
	<description>Build time</description>
	<addressOffset>0x00010014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>BUILDTIME</name>
	<description>Build time of device </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_BUILDTIME_2_REG</name>
	<description>Build time</description>
	<addressOffset>0x00010018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>BUILDTIME</name>
	<description>Build time of device </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_BUILDTIME_3_REG</name>
	<description>Build time</description>
	<addressOffset>0x0001001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>BUILDTIME</name>
	<description>Build time of device </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_DEBUGCONTROL_REG</name>
	<description>Debug control register</description>
	<addressOffset>0x00010390</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000100</resetMask>
	<fields>
	<field>
	<name>DBG_RX_INPUT</name>
	<description>If set, the Rx debug interface will be selected as input for the Rx pipeline. </description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_EVENTCURRVAL_REG</name>
	<description>Value of event generator</description>
	<addressOffset>0x00010058</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>EVENTCURRVAL</name>
	<description>Value of captured Event generator </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_FTDF_CE_REG</name>
	<description>Selection register events</description>
	<addressOffset>0x00010250</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields>
	<field>
	<name>FTDF_CE</name>
	<description>Composite serveice request from ftdf macro (see FR0400 in v40.100.2.41.pdf)
Bit 0 = unused
Bit 1 = rx interrupts
Bit 2 = unused
Bit 3 = miscelaneous interrupts
Bit 4 = tx interrupts
Bit 5 = Reserved </description>
	<access>read-only</access>
	<bitRange>[5:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_FTDF_CM_REG</name>
	<description>Mask selection register events</description>
	<addressOffset>0x00010254</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields>
	<field>
	<name>FTDF_CM</name>
	<description>mask bits for ftf_ce </description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_GLOB_CONTROL_0_REG</name>
	<description>Global control register</description>
	<addressOffset>0x00010020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000ff00</resetValue>
	<resetMask>0x0006ff0e</resetMask>
	<fields>
	<field>
	<name>MACTSCHENABLED</name>
	<description>If set, TSCH mode is enabled </description>
	<access>read-write</access>
	<bitRange>[18:18]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MACLEENABLED</name>
	<description>If set, Low Energy mode is enabled </description>
	<access>read-write</access>
	<bitRange>[17:17]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MACSIMPLEADDRESS</name>
	<description>Simple address of the PAN coordinator </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TX_DMA_REQ</name>
	<description>Source of the TX_DMA_REQ output of this block. </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RX_DMA_REQ</name>
	<description>Source of the RX_DMA_REQ output of this block. </description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ISPANCOORDINATOR</name>
	<description>Enable/disable receiver check on address
fields (0=enabled, 1=disabled) </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_GLOB_CONTROL_1_REG</name>
	<description>Global control register</description>
	<addressOffset>0x00010024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x7fffffff</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>MACSHORTADDRESS</name>
	<description>The values 0xFFFF and 0xFFFE indicate
that no IEEE Short Address is available.
The latter one is used if the device i </description>
	<access>read-write</access>
	<bitRange>[31:16]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MACPANID</name>
	<description>The values 0xFFFF indicates that the device
is not associated </description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_GLOB_CONTROL_2_REG</name>
	<description>Global control register</description>
	<addressOffset>0x00010028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x7fffffff</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>AEXTENDEDADDRESS_L</name>
	<description>Unique device address, lower 32 bit </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_GLOB_CONTROL_3_REG</name>
	<description>Global control register</description>
	<addressOffset>0x0001002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x7fffffff</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>AEXTENDEDADDRESS_H</name>
	<description>Unique device address, higher 16 bit </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_LMACRESET_REG</name>
	<description>Lmax reset register</description>
	<addressOffset>0x00010360</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000106df</resetMask>
	<fields>
	<field>
	<name>LMACGLOBRESET_COUNT</name>
	<description>If set, the LMAC performance and traffic counters will be reset.
Use this register for functionally reset these counters. </description>
	<access>write-only</access>
	<bitRange>[16:16]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LMACRESET_TIMCTRL</name>
	<description>LmacReset_count: A '1' Resets LMAC timing control block (for debug and MLME-reset) </description>
	<access>write-only</access>
	<bitRange>[10:10]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LMACRESET_COUNT</name>
	<description>LmacReset_count: A '1' Resets LMAC mac counters (for debug and MLME-reset) </description>
	<access>write-only</access>
	<bitRange>[9:9]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LMACRESET_SEC</name>
	<description>LmacReset_sec: A '1' Resets LMAC security (for debug and MLME-reset)

