SeanSouth/O1_demo/doc/DA14680AC.xml
#$LmacReset_wutim@on_off_regmap
#LmacReset_wutim: A '1' Resets LMAC wake-up timer (for debug and MLME-reset) </description>
	<access>write-only</access>
	<bitRange>[7:7]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LMACRESET_TSTIM</name>
	<description>LmacReset_tstim: A '1' Resets LMAC timestamp timer (for debug and MLME-reset) </description>
	<access>write-only</access>
	<bitRange>[6:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LMACRESET_OREG</name>
	<description>LmacReset_oreg: A '1' Resets LMAC on_off regmap (for debug and MLME-reset)

#$LmacReset_areg@on_off_regmap
#LmacReset_areg: A '1' Resets LMAC always_on regmap (for debug and MLME-reset) </description>
	<access>write-only</access>
	<bitRange>[4:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LMACRESET_AHB</name>
	<description>LmacReset_ahb: A '1' Resets LMAC ahb interface (for debug and MLME-reset) </description>
	<access>write-only</access>
	<bitRange>[3:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LMACRESET_TX</name>
	<description>LmacReset_tx: A '1' Resets LMAC tx pipeline (for debug and MLME-reset) </description>
	<access>write-only</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LMACRESET_RX</name>
	<description>LmacReset_rx: A '1' Resets LMAC rx pipeline (for debug and MLME-reset) </description>
	<access>write-only</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LMACRESET_CONTROL</name>
	<description>LmacReset_control: A '1' Resets LMAC Controller (for debug and MLME-reset) </description>
	<access>write-only</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_0_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x00010030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>KEEP_PHY_EN</name>
	<description>When the transmit or receive action is ready (LmacReady4Sleep will is set), the phy_en signal is cleared unless the control register keep_phy_en is set.
When the control register keep_phy_en is set, the signal phy_en shall remain being set until the keep_phy_en is cleared. </description>
	<access>read-write</access>
	<bitRange>[31:31]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PTI</name>
	<description>Info to arbiter if phy_en is set </description>
	<access>read-write</access>
	<bitRange>[30:27]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RXALWAYSON</name>
	<description>If set, the receiver shall be always on if
RxEnable is set </description>
	<access>read-write</access>
	<bitRange>[25:25]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RXONDURATION</name>
	<description>Time the Rx must be on </description>
	<access>read-write</access>
	<bitRange>[24:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_10_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x0001010c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x20000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>MACRZZEROVAL</name>
	<description>If the current RZtime is less or Equal to macRZzeroVal an RZtime with value zero is inserted in the wakeup frame </description>
	<access>read-write</access>
	<bitRange>[31:28]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MACCSLMARGINRZ</name>
	<description>The UMAC can set the margin for the expected frame by control register macCSLmarginRZ (in 10 sym).
So the LMAC will make sure the receiver is ready to receive data this amount of time earlier than to be expected by the received RZ time </description>
	<access>read-write</access>
	<bitRange>[19:16]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MACWURZCORRECTION</name>
	<description>This register shall be used if the Wake-up frame to be transmitted is larger than 15 octets.
It shall indicate the amount of extra data in a Wake-up frame after the RZ position in the frame (in 10 sym). </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_11_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x0001006c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0001ffff</resetMask>
	<fields>
	<field>
	<name>MACDISCARXOFFTORZ</name>
	<description>This switching off and on of the PHY Rx can be disabled whith the control register macDisCaRxOfftoRZ.
0 : Disabled
1 : Enabled </description>
	<access>read-write</access>
	<bitRange>[16:16]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MACRXTOTALCYCLETIME</name>
	<description>In order to make it easier to calculate if it is efficient to disable and enable the PHY Rx until the RZ time is reached, a control register indicates the time needed to disable and enable the PHY Rx: macRxTotalCycleTime (resolution in 10 sym) </description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_1_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x00010040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>PHYRXATTR_HSI</name>
	<description>HighSide injection. </description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYRXATTR_RF_GPIO_PINS</name>
	<description>Slot-basis signals mapped on GPIO via PPA. </description>
	<access>read-write</access>
	<bitRange>[14:12]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYRXATTR_CALCAP</name>
	<description>CalCap value. </description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYRXATTR_CN</name>
	<description>Channel Number. </description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYRXATTR_DEM_PTI</name>
	<description>DEM packet information. </description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_2_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x00010044</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>EDSCANDURATION</name>
	<description>Length of ED scan </description>
	<access>read-write</access>
	<bitRange>[31:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>EDSCANENABLE</name>
	<description>if set, Energy Detect scan will be done </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_3_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x00010048</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000004c4</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields>
	<field>
	<name>CCAIDLEWAIT</name>
	<description>Time to wait after CCA returned &amp;quot;medium idle&amp;quot; before starting TX-ON (in us).
Note: not applicable in TSCH mode since there macTSRxTx shall be used. </description>
	<access>read-write</access>
	<bitRange>[23:16]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MACMAXFRAMETOTALWAITTIME</name>
	<description>Max time to wait for a requested Data Frame or an announced broadcast frame </description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_4_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x00010060</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PHYACKATTR_HSI</name>
	<description>HighSide injection. </description>
	<access>read-write</access>
	<bitRange>[31:31]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYACKATTR_RF_GPIO_PINS</name>
	<description>Slot-basis signals mapped on GPIO via PPA. </description>
	<access>read-write</access>
	<bitRange>[30:28]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYACKATTR_CALCAP</name>
	<description>CalCap value. </description>
	<access>read-write</access>
	<bitRange>[27:24]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYACKATTR_CN</name>
	<description>Channel Number. </description>
	<access>read-write</access>
	<bitRange>[23:20]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYACKATTR_DEM_PTI</name>
	<description>DEM packet information. </description>
	<access>read-write</access>
	<bitRange>[19:16]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RXPIPEPROPDELAY</name>
	<description>The control register RxPipePropDelay indicates the propagation delay in ~s of the Rx pipeline between the last symbol being captured at the DPHY interface and the &amp;quot;data valid&amp;quot; indication to the LMAC controller. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYSLEEPWAIT</name>
	<description>Time between negate and assert PHY_EN
When the signal phy_en is deasserted, it will not be asserted within the time phySleepWait.
This time is indicated by the control register phySleepWait (resolution: ~s). </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_5_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x00010064</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000008c0</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PHYCSMACAATTR_HSI</name>
	<description>HighSide injection. </description>
	<access>read-write</access>
	<bitRange>[31:31]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYCSMACAATTR_RF_GPIO_PINS</name>
	<description>Slot-basis signals mapped on GPIO via PPA. </description>
	<access>read-write</access>
	<bitRange>[30:28]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYCSMACAATTR_CALCAP</name>
	<description>CalCap value. </description>
	<access>read-write</access>
	<bitRange>[27:24]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYCSMACAATTR_CN</name>
	<description>Channel Number. </description>
	<access>read-write</access>
	<bitRange>[23:20]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYCSMACAATTR_DEM_PTI</name>
	<description>DEM packet information. </description>
	<access>read-write</access>
	<bitRange>[19:16]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CCASTATWAIT</name>
	<description>The output CCASTAT is valid after 8 symbols + phyRxStartup.
The 8 symbols are programmable by control registerCcaStatWait[4] in symbol timesl.
Default value is 8d. </description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ACK_RESPONSE_DELAY</name>
	<description>In order to have some flexibility the control register Ack_Response_Delay indicates the Acknowledge response time in ~s.
The default value shall is 192 ~s (12 symbols). </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_6_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x00010068</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000c0c28</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields>
	<field>
	<name>WUIFSPERIOD</name>
	<description>The WakeUp IFS period is programmable by WUifsPeriod (in symbols).
The default is 12 symbols (192 ~s). </description>
	<access>read-write</access>
	<bitRange>[23:16]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SIFSPERIOD</name>
	<description>The SIFS period is programmable by SifsPeriod (in symbols).
The default is 12 symbols (192 ~s). </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LIFSPERIOD</name>
	<description>The LIFS period is programmable by LifsPeriod (in symbols).
The default is 40 symbols (640 ~s), </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_7_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x00010100</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00420000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>MACCSLSAMPLEPERIOD</name>
	<description>When performing a idle listening, the receiver is enabled for at least macCSLsamplePeriod (in symbols). </description>
	<access>read-write</access>
	<bitRange>[31:16]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MACWUPERIOD</name>
	<description>Wake-up duration in symbols. </description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_8_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x00010104</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>MACCSLSTARTSAMPLETIME</name>
	<description>The control register macCSLstartSampleTime indicates the TimeStamp generator time (in symbols) when to start listening (called &amp;quot;idle listening&amp;quot;). </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_9_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x00010108</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000042</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>MACCSLFRAMEPENDINGWAITT</name>
	<description>If a non Wake-up frame with Frame Pending bit = '1' is received, the receiver is enabled for at least an extra period of macCSLFramePendingWaitT (in symbols) after the end of the received frame.
The time the Enhanced ACK transmission lasts (if applicable) is included in this time. </description>
	<access>read-write</access>
	<bitRange>[31:16]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MACCSLDATAPERIOD</name>
	<description>After the wake-up sequence a frame is expected, the receiver will be enabled for at least a period of macCSLdataPeriod (in symbols). </description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_DELTA_REG</name>
	<description>Lmac delta control register</description>
	<addressOffset>0x00010070</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007e</resetMask>
	<fields>
	<field>
	<name>WAKEUPTIMERENABLESTATUS_D</name>
	<description>Delta which indicates that WakeupTimerEnableStatus has changed </description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>GETGENERATORVAL_E</name>
	<description>Event which indicates the getGeneratorVal request is completed </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SYMBOLTIME2THR_E</name>
	<description>Event that symboltime counter matched SymbolTime2Thr </description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SYMBOLTIMETHR_E</name>
	<description>Event that symboltime counter matched SymbolTimeThr </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SYNCTIMESTAMP_E</name>
	<description>The SyncTimeStamp_e event is set when the TimeStampgenerator is loaded with SyncTimeStampVal.
This occurs at the rising edge of lp_clk when SyncTimeStampEna is set and the value of the Event generator is equal to the value SyncTimestampThr. </description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LMACREADY4SLEEP_D</name>
	<description>Delta bit for register &amp;quot;LmacReady4sleep&amp;quot; </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_MASK_REG</name>
	<description>Lmac mask control register</description>
	<addressOffset>0x00010080</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007e</resetMask>
	<fields>
	<field>
	<name>WAKEUPTIMERENABLESTATUS_M</name>
	<description>Mask for WakeupTimerEnableStatus_d </description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>GETGENERATORVAL_M</name>
	<description>Mask for getGeneratorVal_e </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SYMBOLTIME2THR_M</name>
	<description>Mask for SymbolTime2Thr_e </description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SYMBOLTIMETHR_M</name>
	<description>Mask for SymbolTimeThr_e </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SYNCTIMESTAMP_M</name>
	<description>Mask bit for event register SyncTimeStamp_e. </description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LMACREADY4SLEEP_M</name>
	<description>Mask bit for delta bit &amp;quot;LmacReady4sleep_d&amp;quot; </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_OS_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x00010050</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000007</resetMask>
	<fields>
	<field>
	<name>SINGLECCA</name>
	<description>If set, a single CCA will be performed. </description>
	<access>write-only</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RXENABLE</name>
	<description>If set, receiving data may be done </description>
	<access>write-only</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>GETGENERATORVAL</name>
	<description>If set, the current values of WU gen and TS gen will be captured. </description>
	<access>write-only</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_STATUS_REG</name>
	<description>Lmac status register</description>
	<addressOffset>0x00010054</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ff46</resetMask>
	<fields>
	<field>
	<name>EDSCANVALUE</name>
	<description>Result of ED scan. </description>
	<access>read-only</access>
	<bitRange>[15:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>WAKEUPTIMERENABLESTATUS</name>
	<description>Status of WakeupTimerEnable after being clocked by LP_CLK (showing it's effective value). </description>
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CCASTAT</name>
	<description>Value single CCA when CCAstat_e is set. </description>
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LMACREADY4SLEEP</name>
	<description>Indicates that the LMAC is ready to go to sleep. </description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_LMAC_EVENT_REG</name>
	<description>Lmac event regsiter</description>
	<addressOffset>0x00010090</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000007</resetMask>
	<fields>
	<field>
	<name>RXTIMEREXPIRED_E</name>
	<description>Set if one of the timers enabling the RX-ON mode expires without having received any valid frame </description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CCASTAT_E</name>
	<description>If set, the single CCA is ready </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>EDSCANREADY_E</name>
	<description>The event EdScanReady_e is set to notify that the ED scan is ready. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_LMAC_MANUAL_1_REG</name>
	<description>Lmax manual PHY register</description>
	<addressOffset>0x000100a0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
