SeanSouth/O1_demo/doc/DA14680AC.xml
	<bitRange>[10:10]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PID</name>
	<description>See P00_MODE_REG[PID] </description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>P46_MODE_REG</name>
	<description>P46 Mode Register</description>
	<addressOffset>0x0000006a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>PPOD</name>
	<description>0: Push pull
1: Open drain</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PID</name>
	<description>See P00_MODE_REG[PID] </description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>P47_MODE_REG</name>
	<description>P47 Mode Register</description>
	<addressOffset>0x0000006c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>PPOD</name>
	<description>0: Push pull
1: Open drain</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PID</name>
	<description>See P00_MODE_REG[PID] </description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>P4_DATA_REG</name>
	<description>P4 Data input / output Register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>P4_DATA</name>
	<description>Set P4 output register when written; Returns the value of P4 port when read </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>P4_PADPWR_CTRL_REG</name>
	<description>P4 Output Power Control Register</description>
	<addressOffset>0x000000c8</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>P4_OUT_CTRL</name>
	<description>1 = P4_x port output is powered by VDD1V8P rail
0 = P4_x port output is powered by V33 rail
bit x controls the power supply of P4[x]</description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>P4_RESET_DATA_REG</name>
	<description>P4 Reset port pins Register</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>P4_RESET</name>
	<description>Writing a 1 to P4[y] sets P4[y] to 0. Writing 0 is discarded;
Reading returns 0</description>
	<access>write-only</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>P4_SET_DATA_REG</name>
	<description>P4 Set port pins Register</description>
	<addressOffset>0x00000012</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>P4_SET</name>
	<description>Writing a 1 to P4[y] sets P4[y] to 1. Writing 0 is discarded; Reading returns 0</description>
	<access>write-only</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RAMBIST_STATUS1_REG</name>
	
	<addressOffset>0x000000e2</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000036db</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>ROM_BIST_BUSY</name>
	<description>status of internal signal "busy" of rom bist </description>
	<access>read-only</access>
	<bitRange>[15:15]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>QSPIRAM_BIST_BUSY</name>
	<description>status of internal signal "busy" of qspiram bist </description>
	<access>read-only</access>
	<bitRange>[14:14]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>QSPIRAM_BIST_FAIL</name>
	<description>status of internal signal "fail" of qspiram bist </description>
	<access>read-only</access>
	<bitRange>[13:13]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>QSPIRAM_BIST_LINE_FAIL</name>
	<description>status of internal signal "line_fail" of qspiram bist </description>
	<access>read-only</access>
	<bitRange>[12:12]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USBRAM_BIST_BUSY</name>
	<description>status of internal signal "busy" of usbram bist </description>
	<access>read-only</access>
	<bitRange>[11:11]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USBRAM_BIST_FAIL</name>
	<description>status of internal signal "fail" of usbram bist </description>
	<access>read-only</access>
	<bitRange>[10:10]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USBRAM_BIST_LINE_FAIL</name>
	<description>status of internal signal "line_fail" of usbram bist </description>
	<access>read-only</access>
	<bitRange>[9:9]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CDRAM_BIST_BUSY</name>
	<description>status of internal signal "busy" of cdram bist </description>
	<access>read-only</access>
	<bitRange>[8:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CDRAM_BIST_FAIL</name>
	<description>status of internal signal "fail" of cdram bist </description>
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CDRAM_BIST_LINE_FAIL</name>
	<description>status of internal signal "line_fail" of cdram bist </description>
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CTRAM_BIST_BUSY</name>
	<description>status of internal signal "busy" of ctram bist </description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CTRAM_BIST_FAIL</name>
	<description>status of internal signal "fail" of ctram bist </description>
	<access>read-only</access>
	<bitRange>[4:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CTRAM_BIST_LINE_FAIL</name>
	<description>status of internal signal "line_fail" of ctram bist </description>
	<access>read-only</access>
	<bitRange>[3:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SYSRAM_BIST_BUSY</name>
	<description>status of internal signal "busy" of sysram bist </description>
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SYSRAM_BIST_FAIL</name>
	<description>status of internal signal "fail" of sysram bist </description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SYSRAM_BIST_LINE_FAIL</name>
	<description>status of internal signal "line_fail" of sysram bist </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RAMBIST_STATUS2_REG</name>
	
	<addressOffset>0x000000e4</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000036db</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CRYPTORAM_BIST_BUSY</name>
	<description>status of internal signal "busy" of cryptoram bist </description>
	<access>read-only</access>
	<bitRange>[14:14]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CRYPTORAM_BIST_FAIL</name>
	<description>status of internal signal "fail" of cryptoram bist </description>
	<access>read-only</access>
	<bitRange>[13:13]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CRYPTORAM_BIST_LINE_FAIL</name>
	<description>status of internal signal "line_fail" of cryptoram bist </description>
	<access>read-only</access>
	<bitRange>[12:12]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ECC_TCMRAM_BIST_BUSY</name>
	<description>status of internal signal "busy" of ecc_tcmram bist </description>
	<access>read-only</access>
	<bitRange>[11:11]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ECC_TCMRAM_BIST_FAIL</name>
	<description>status of internal signal "fail" of ecc_tcmram bist </description>
	<access>read-only</access>
	<bitRange>[10:10]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ECC_TCMRAM_BIST_LINE_FAIL</name>
	<description>status of internal signal "line_fail" of ecc_tcmram bist </description>
	<access>read-only</access>
	<bitRange>[9:9]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ECC_CODERAM_BIST_BUSY</name>
	<description>status of internal signal "busy" of ecc_coderam bist </description>
	<access>read-only</access>
	<bitRange>[8:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ECC_CODERAM_BIST_FAIL</name>
	<description>status of internal signal "fail" of ecc_coderam bist </description>
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ECC_CODERAM_BIST_LINE_FAIL</name>
	<description>status of internal signal "line_fail" of ecc_coderam bist </description>
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>FTDF_RXRAM_BIST_BUSY</name>
	<description>status of internal signal "busy" of ftdf_rxram bist </description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>FTDF_RXRAM_BIST_FAIL</name>
	<description>status of internal signal "fail" of ftdf_rxram bist </description>
	<access>read-only</access>
	<bitRange>[4:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>FTDF_RXRAM_BIST_LINE_FAIL</name>
	<description>status of internal signal "line_fail" of ftdf_rxram bist </description>
	<access>read-only</access>
	<bitRange>[3:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>FTDF_TXRAM_BIST_BUSY</name>
	<description>status of internal signal "busy" of ftdf_txram bist </description>
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>FTDF_TXRAM_BIST_FAIL</name>
	<description>status of internal signal "fail" of ftdf_txram bist </description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>FTDF_TXRAM_BIST_LINE_FAIL</name>
	<description>status of internal signal "line_fail" of ftdf_txram bist </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>ROMBIST_RESULTH_REG</name>
	
	<addressOffset>0x000000e8</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>ROMBIST_RESULTH</name>
	<description>Read version of bist status, result[31:16] </description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>ROMBIST_RESULTL_REG</name>
	
	<addressOffset>0x000000e6</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>ROMBIST_RESULTL</name>
	<description>Read version of bist status, result[15:0] </description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>TEST_CTRL2_REG</name>
	
