SeanSouth/O1_demo/doc/DA14680AC.xml
	<addressOffset>0x000000f2</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RF_IN_TESTMUX_CTRL</name>
	<description>Connect the RF input testbus to pins:
Switch 1 (bit 8) connects T0 of the radio test input bus to P0[7]
Switch 2 (bit 9) connects T1 of the radio test input bus to P1[3]
If this bit is 0, the switch is open (not conducting).</description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ANA_TESTMUX_CTRL</name>
	<description>Control of analog test bus switches:
Switch 1 connects T0 of the radio test output bus to P1[7]
Switch 2 connects T1 of the radio test output bus to P1[4]
Switch 3 connects T0 of the analog test output bus to P1[7]
Switch 4 connects T1 of the analog test output bus to P1[4]

0: all switches open
1: only switch 1 closed
2: only switch 2 closed
3: only switch 3 closed
4: only switch 4 closed
5: switches 1 &amp; 2 closed
6: switches 1 &amp; 4 closed
7: switches 2 &amp; 3 closed
8: switches 3 &amp; 4 closed </description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>TEST_CTRL3_REG</name>
	
	<addressOffset>0x000000f4</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RF_TEST_OUT_PARAM</name>
	<description>Select which test will be enabled on the block selected by the RF output testbus (see </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USBCOMP_TEST</name>
	<description>Force switch from V33 VBAT LDO to V33 VBUS LDO by forcing VBUS_HIGH and VBUS_LOW to 'high' when this bit is set to 1; normal operation when set to 0</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RF_TEST_OUT_SEL</name>
	<description>Select a radio block to have its testbus connected to P1[1] and P1[2]. See
Table 7
for more information.
NOTE: all 0 represent no testmode and the testbusses are shorted to ground to prevent floating busses. </description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>TEST_CTRL4_REG</name>
	
	<addressOffset>0x000000f6</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RF_TEST_IN_PARAM</name>
	<description>Select which test will be enabled on the block selected by the RF output testbus (see </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RF_TEST_IN_SEL</name>
	<description>Select an RF block to have its test input connected to the input testbus at pins P0[0] and P0[3]. NOTE: all 0 represent no testmode and the testbusses are shorted to ground to prevent floating busses. </description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>TEST_CTRL5_REG</name>
	
	<addressOffset>0x000000f8</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>TEST_VREF_1V2_A</name>
	
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TEST_VCONT_A</name>
	
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TEST_I_DCDC_FILT</name>
	
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TEST_BOD_VREF_IN</name>
	
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TEST_BOD_VREF_OUT</name>
	
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TEST_SIMO_BUCK</name>
	
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TEST_BANDGAP_I_TEST</name>
	
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TEST_LDO_PLL</name>
	
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TEST_LDO_ADC</name>
	
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TEST_LDO_1V8_PA</name>
	
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TEST_LDO_CORE</name>
	
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TEST_LDO_1V8_FLASH</name>
	
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TEST_LDO_1V4</name>
	
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TEST_BUS_TO_AVS</name>
	
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>TEST_CTRL_REG</name>
	
	<addressOffset>0x000000f0</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>SHOW_PWR_TST_OUT</name>
	<description>0: Normal operation
1: P1[7:1] = ldo_1v8_flash_ret_enable, ldo_supply_vbat_ok, ldo_supply_usb_ok, ldo_1v8_pa_ret_enable, bandgap_bgr_ok, 0, ldo_vbat_ret_enable
2: P1[7:1] = ldo_vbat_ret_vref_hold, ldo_core_ok, pll_status_reg_isolated_1, ldo_radio_ok,ldo_1v8_pa_ok, ldo_1v8_flash_ok, ldo_supply_usb_enable
3: P1[7:1] = ldo_1v8_flash_ret_vref_hold, vbus_available, newbat, clear_newbat, ldo_1v8_pa_ret_vref_hold, 0, power_on_reset
4: P1[7:1] = comp_v18_pa_high, comp_v18_flash_high, comp_vdd_high, comp_vbus_low, comp_vbus_high, comp_v33_high, comp_vbat_ok
5: P1[7:1] = charge_gate_enable, bod_v18_pa_low, bod_v33_low, bod_v18_flash_low, bod_vdd_low, bod_vbat_low, bod_clk
</description>
	<access>read-write</access>
	<bitRange>[10:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SHOW_TXDAC_MOD</name>
	<description>0: Normal operation
1: show the TxDAC_MOD bus on P1[6:4]</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PLL_TST_MODE</name>
	<description>0: Normal operation
1: Show the PLL test mode signals:
P07 = RCLK
P16 = NCLK
P13 = CP_UP
P11 = CP_DOWN
Notes:
- The control signal should go to the radio to enable this test mode. </description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SHOW_IF_RO</name>
	<description>0: Normal Port function.
1: Show IF filter Reference Oscillator I and Q signals.
P10 = iff_ro_out_i
P06 = iff_ro_out_q </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>XTAL16M_CAP_TEST_EN</name>
	<description>0: Normal Port function.
1: Show xtal16m_cap_test_outoutput P1[1:0]
Notes:
- The control signal should go to the radio to enable this test mode.
- This register should be zero during scan test! </description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SHOW_DCDC_TESTBUS</name>
	<description>0: normal port function
1: map the DCDC testbus [11:0] on the following GPIO's (MSB first): P23,P21,P20,P1[7:0],P07</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SHOW_PLL_TEST_OUT</name>
	<description>0: normal port function
1: map pll_out_div_test_out on P06 and pll_loop_div_test_out on P10</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ENABLE_RFPT</name>
	<description>0: normal port function
1: enable the RF Production Test Unit. Used to store RX ADC samples or PLL TDC samples in SRAM.
See RFPT_CTRL_REG, RFPT_ADDR_REG and RFPT_LEN_REG for details. </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SHOW_CLOCKS</name>
	<description>0: normal port function
1: show DIVN clock on P10
</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>GPREG</name>
	<version>1.0</version>
	<description>GPREG registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50003300</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>26</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>DEBUG_REG</name>
	<description>Various debug information register.</description>
	<addressOffset>0x00000004</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>DEBUGS_FREEZE_EN</name>
	<description>Default '1', freezing of the on-chip timers is enabled when the Cortex-M0 is halted in DEBUG State.
If '0', freezing of the on-chip timers is depending on FREEZE_REG when the Cortex-M0 is halted in DEBUG State except the watchdog timer. The watchdog timer is always frozen when the Cortex-M0 is halted in DEBUG State.
Note: This bit is retained.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>ECC_BASE_ADDR_REG</name>
	<description>Base address of the ECC Crypto memory register.</description>
	<addressOffset>0x0000000a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>ECC_BASE_ADDR</name>
	<description>Contains the base address of the ECC Crypto memory.
Memory allocation is in pages of 1KB and up to 127KB.
Since the ECC has an address range of 2KB and the total addressable memory range is 128KB, the maximum value of 0x7F (127KB offset) will result in 1KB at the top of the memory range and the other 1KB at the bottom of the memory range.</description>
	<access>read-write</access>
	<bitRange>[6:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>GP_CONTROL_REG</name>
	<description>General purpose system control register.</description>
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>BLE_DEEPSLDUR_MONITOR</name>
	<description>The 8 LSBs of the current value of the BLE Timer DEEPSLDUR. The value has been sampled by using the CPU clock.</description>
	<access>read-only</access>
	<bitRange>[15:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>BLE_WAKEUP_LP_IRQ</name>
	<description>The current value of the BLE_WAKEUP_LP_IRQ interrupt request.</description>
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>BLE_H2H_BRIDGE_BYPASS</name>
	<description>If '1', the AHB-to-AHB bridge is bypassed, needed to access the BLE Register file, only when the system clock source is the XTAL and both hclk and ble_hclk are running at 16MHz, i.e. at the XTAL clock rate.</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>BLE_WAKEUP_REQ</name>
	<description>If '1', the BLE wakes up. Must be kept high at least for 1 low power clock period. 
If the BLE is in deep sleep state, then by setting this bit it will cause the wakeup LP IRQ to be asserted with a delay of 3 to 4 low power cycles.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>GP_STATUS_REG</name>
	<description>General purpose system status register.</description>
	<addressOffset>0x00000006</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CAL_PHASE</name>
	<description>If '1', it designates that the chip is in Calibration Phase i.e. the OTP has been initially programmed but no Calibration has occured. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>LED_CONTROL_REG</name>
	<description>Controls muxing and enabling of the LEDs.</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>LED3_EN</name>
	<description>0: LED3 disabled,
1: LED3 enabled.</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LED2_EN</name>
	<description>0: LED2 disabled,
1: LED2 enabled.</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LED1_EN</name>
	<description>0: LED1 disabled,
1: LED1 enabled.</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LED3_SRC_SEL</name>
	<description>0: LED3 = PWM4,
1: LED3 = Breathing Timer.</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LED2_SRC_SEL</name>
	<description>0: LED2 = PWM3,
1: LED2 = Breathing Timer.</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LED1_SRC_SEL</name>
	<description>0: LED1 = PWM2,
1: LED1 = Breathing Timer.
Note: The PWM2/3/4 can also be routed to GPIOs using PID 25/26/27 respectively.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>PLL_SYS_CTRL1_REG</name>
	<description>System PLL control register 1.</description>
	<addressOffset>0x00000010</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000100</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>PLL_R_DIV</name>
	<description>PLL Output dvider R (x means divide by x, 0 means divide by 1)</description>
	<access>read-write</access>
	<bitRange>[14:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LDO_PLL_VREF_HOLD</name>
	<description>0: indicates that the reference input is tracked,
1: indicates that the reference input is sampled.</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LDO_PLL_ENABLE</name>
	<description>0: LDO PLL off,
1: LDO PLL on.</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PLL_EN</name>
	<description>0: Power down
1: PLL on </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>PLL_SYS_CTRL2_REG</name>
	<description>System PLL control register 2.</description>
	<addressOffset>0x00000012</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00002006</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>PLL_SEL_MIN_CUR_INT</name>
	<description>0: VCO current read from min_current &lt;5:0&gt;,
1: VCO current is internally determined with a calibration algoritm.</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PLL_DEL_SEL</name>
	<description>PLL manual delay value for Phase Frequency Detector.
0: 0.493
1: 0.814
2: 1.13 ns &lt;- default
3: 1.44 ns </description>
	<access>read-write</access>
	<bitRange>[13:12]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PLL_N_DIV</name>
	<description>PLL Loop divider N (x means divide by x, 0 means divide by 1) </description>
	<access>read-write</access>
	<bitRange>[6:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>PLL_SYS_CTRL3_REG</name>
	<description>System PLL control register 3.</description>
	<addressOffset>0x00000014</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00003c09</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>PLL_RECALIB</name>
	<description>Recalibrate</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PLL_START_DEL</name>
	<description>Programmable delay time for the loop filter voltage preset value. After PLL_EN is set, the loopfilter precharge resistors are disabled after this delay time. One LSB is 48 ns </description>
	<access>read-write</access>
	<bitRange>[14:10]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PLL_ICP_SEL</name>
	<description>PLL charge pump current select
One LSB is 5uA. </description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>PLL_SYS_STATUS_REG</name>
	<description>System PLL status register.</description>
	<addressOffset>0x00000016</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>PLL_CALIBR_END</name>
	<description>Indicates that calibration has finished.</description>
	<access>read-only</access>
	<bitRange>[11:11]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PLL_PLL_BEST_MIN_CUR</name>
	<description>Calibrated VCO frequency band.</description>
	<access>read-only</access>
	<bitRange>[10:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LDO_PLL_OK</name>
	<description>1: Indicates that LDO PLL is in regulation.</description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PLL_LOCK_FINE</name>
	<description>1: PLL locked </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>PLL_SYS_TEST_REG</name>
	<description>System PLL test register.</description>
	<addressOffset>0x00000018</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000070</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>PLL_LOCK_DET_RES_CNT</name>
	<description>Lock measurement time in &lt;tbd&gt; clock cycle of xx usec. After this period PLL_LOCK_FINE is calculated based on the difference of the M and N counted pulses in that period. If PLL_LOCK_FINE is still 0, the lock state machine restarts until PLL_LOCK_FINE gets 1
0: &lt;tbd&gt; usec
7: &lt;tbd&gt; usec </description>
	<access>read-write</access>
	<bitRange>[15:13]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PLL_SEL_R_DIV_TEST</name>
	<description>Select test mode for output divider R
Maps PLL_R_DIV input on pins &lt;tbd&gt; and divider output on pin &lt;tbd&gt; </description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PLL_SEL_N_DIV_TEST</name>
	<description>Select test mode for loop divider N.
Maps PLL_N_DIV input on pins &lt;tbd&gt; and divider output on pin &lt;tbd&gt; </description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PLL_CHANGE</name>
	<description>0: normal value
1: reverse charge pump up/down signals </description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PLL_OPEN_LOOP</name>
	<description>1: set to open loop to termine max frequency </description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PLL_TEST_VCTR</name>
	<description>1: map loopfilter voltage on external pin &lt;tbd&gt; </description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PLL_MIN_CURRENT</name>
	<description>VCO current trimming.</description>
	<access>read-write</access>
	<bitRange>[6:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PLL_DIS_LOOPFILT</name>
	<description>1: disable PLL internal loop filter </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RESET_FREEZE_REG</name>
	<description>Controls unfreezing of various timers/counters (incl. DMA and USB).</description>
	<addressOffset>0x00000002</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>FRZ_SWTIM2</name>
	<description>If '1', the SW Timer (TIMER2) continues, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>FRZ_SWTIM1</name>
	<description>If '1', the SW Timer (TIMER1) continues, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>FRZ_DMA</name>
	<description>If '1', the DMA continues, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>FRZ_USB</name>
	<description>If '1', the USB continues, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
